{"count": 1, "notes": [{"content": "<p>This blog is \"powered\" by <a href=\"lekhakpadmanabh.github.io\">GitNote</a> - a command line note management utility I wrote up quickly to cater specifically to my requirements. There are a couple of rough edges but it is mostly functional. At this point I cannot recommend anyone to use it, mainly because it is being built and tested on github pages, which forbids angular's routing-- which means no permalinking to individual articles. When I was writing it this wasn't a concern for me, but I will probably write its own cusotm backend one of these days.</p>\n\n<h2>Usage</h2>\n\n<p>Notes can be made inline or in markdown files, which are stored in a notes/ folder. Python then asks git for changes in this folder, parses the file, converts it file to html, puts them in a nice json file which is then used by angular on the frontend. For a detailed README visit </p>\n\n<p>Source code: \nTechnologies: git, python, javascript (Angular), css (bootstrap), html</p>\n\n<h3>New note default</h3>\n\n<pre><code>gitnote new -t \"Powered by gitnote\" -g \"python,angular,github, git\"\n\n</code></pre>\n\n<p>You can also use the verbose flags,<code>--title</code> and  <code>--tags</code>. The above command creates a opens a new file in your default text-editor. Enter your note in markdown, save it, close and run </p>\n\n<pre><code>gitnote build\n</code></pre>\n\n<p>If it is your first time it'll ask for some adidtional info, then your note is tracked and committed. Now you just push to whatever is your remote static file server and you're done. In my case, I am using the free github pages.</p>\n\n<pre><code>git push origin master\n</code></pre>\n\n<h3>New note inline</h3>\n\n<p>For short notes, </p>\n\n<pre><code>gitnote inline -b \"hello world\" -t \"this is the title\" -g \"hello,world\"\n</code></pre>\n\n<p>and that's all.</p>\n\n<h2>Supported Markdown Features</h2>\n\n<ul>\n<li><em>italics</em></li>\n<li><strong>bold</strong></li>\n<li>unordered lists</li>\n</ul>\n\n<ol>\n<li>Ordered</li>\n<li>List</li>\n</ol>\n\n<blockquote>\n  <p>Block Quotes</p>\n</blockquote>\n\n<div class=\"codehilite\"><pre><code><span class=\"k\">print</span> <span class=\"s\">&quot;code blocks&quot;</span>\n</code></pre></div>\n\n<p>Images: <img src=\"images/wwgd.png\" alt=\"wwgd\" /></p>\n\n<h2>To Do</h2>\n\n<ol>\n<li>If user changes title, rename the file</li>\n<li>Generate standalone html for permalinking</li>\n<li>Wiki features-- revision history, etc.</li>\n<li>Add ipython notebook support.</li>\n</ol>\n", "date_created": "14-09-2014 23:41:31", "tags": ["python", "angular", "github", " git"], "id": 1, "title": "Powered by gitnote"}], "Blog Title": "Plog", "pages": [], "Author": "Padmanabh"}
